### Terraform Plan

```mermaid
flowchart TB

classDef default fill:#ffffff,stroke:#585c5e,color:#585c5e;
classDef succeeded fill:#a3cfbb,stroke:#136c44,color:#136c44;
classDef failed fill:#f0aeb5,stroke:#af2a36,color:#af2a36;

A(A)
B(B)
A --> B
C(C)
A --> C
D(D)
C --> D
E(E)
B --> E
F(F)
C --> F
G(G)
E --> G
F --> G
D --> G

F:::succeeded
G:::succeeded
```

<details>
<summary>Module <strong>"F"</strong></summary>

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Installing hashicorp/random v3.5.1...
- Installed hashicorp/random v3.5.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

--------------------------------------------------------------------------------


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.rand will be created
  + resource "random_id" "rand" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "content" = "F"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id = (known after apply)
```

</details>
<details>
<summary>Module <strong>"G"</strong></summary>

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Installing hashicorp/random v3.5.1...
- Installed hashicorp/random v3.5.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

--------------------------------------------------------------------------------


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.rand will be created
  + resource "random_id" "rand" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "content" = "G"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id = (known after apply)
```

</details>
